In [138]:
import pandas as pd
data_file = 'day.txt'
# data_file = 'test.txt'
df = pd.read_csv(data_file, sep=r'\s+', header=None)
df.head()

       0      1
0  88276  66757
1  66898  13714
2  58877  87487
3  69396  12997
4  53434  62485

In [139]:
for col in df.columns:
    df[col] = sorted(df[col])
df['dist'] = abs(df[1] - df[0])
df.head()

       0      1  dist
0  10182  10108    74
1  10336  10498   162
2  10354  10676   322
3  10410  10730   320
4  10793  10793     0

In [140]:
print("Answer 1:", df['dist'].sum())

Answer 1: 1970720

In [142]:
df['count'] = df[0].map(df[1].value_counts())
df['mul'] = df[0] * df['count']
print("Answer 2:", int(df['mul'].sum()))
df[df['count'] > 0].head()

Answer 2: 17191599

        0      1  dist  count       mul
4   10793  10793     0   10.0  107930.0
27  13273  12873   400    6.0   79638.0
32  13714  13273   441   15.0  205710.0
46  14772  13714  1058    1.0   14772.0
52  15331  13714  1617    3.0   45993.0